[
  {
    "date": "2025-10-25",
    "items": [
      {
        "type": "✨ improved",
        "desc": "Added alternating row colors and hover highlights to the Quarterly Expense Report table for better readability and visual clarity."
      },
      {
        "type": "🆕 new",
        "desc": "Introduced subtle but slightly stronger alternate row shading to enhance table legibility without being distracting."
      },
      {
        "type": "🆕 new",
        "desc": "Income and Expenditure filter checkboxes added above the table; selecting/deselecting them dynamically updates the table and corresponding charts."
      }
    ]
  },
  {
    "date": "2025-10-17",
    "items": [
      {
        "type": "🆕 new",
        "desc": "Added Quarterly Expense Report page with interactive charts, budget gauge, and table view for Q2 2025."
      },
      {
        "type": "✨ improved",
        "desc": "Enhanced the page with light gradient background and responsive layout for better readability and mobile experience."
      },
      {
        "type": "🆕 new",
        "desc": "Included contextual note highlighting increased costs due to special festivals and urgent maintenance, displayed only for relevant quarters."
      }
    ]
  },
  {
    "date": "2025-10-10",
    "items": [
      {
        "type": "🆕 new",
        "desc": "Countdown to Kali Puja is added on the home page (index.html) to help visitors track the upcoming festival."
      },
      {
        "type": "🆕 new",
        "desc": "diwali.html page is added and will be invoked automatically on 20th Oct 2025 to celebrate Diwali."
      },
      {
        "type": "✨ improved",
        "desc": "Governing body page has been updated to reflect the selected EC members during AGM held on 27th July 2025."
      }
    ]
  },
  {
    "date": "2025-09-17",
    "items": [
      {
        "type": "✨ improved",
        "desc": "Updated darshan.html page to include a dedicated Virtual Darshan section for an enhanced spiritual experience."
      },
      {
        "type": "🆕 new",
        "desc": "Added Durga Puja Nirghanta section, providing detailed and accessible event information."
      }
    ]
  }
]
